tests/artillery100-10000.yml
config:
  target: "http://0.0.0.0:8080"
  phases:
    - duration: 1
      arrivalRate: 100
      maxVusers: 100
  plugins:
    metrics-by-endpoint: {}  # Plugin to measure metrics by endpoint
  stats:
    percentiles: [90,95]

scenarios:
  - flow:
    - loop:
      - get:
          url: '/ping'
      count: 100